
# Bug-001:

## Система позволяет сформировать третий титул без получения второго титула

Severity

Critical

## Предусловия

Создана и отправлена ЭТрН.

## Шаги воспроизведения 
Создать ЭТрН. 
Отправить документ перевозчику. 
Не выполнять этап формирования второго титула. 
Перейти к этапу завершения погрузки. 
Сформировать третий титул. 

## Фактический результат

Третий титул успешно формируется.

## Ожидаемый результат

Третий титул не должен формироваться до получения второго титула.

## Комментарий

Нарушается последовательность юридически значимого документооборота.

# Bug-002

## Система позволяет сформировать второй титул при установленном признаке замечаний без заполнения описания несоответствий

Severity

Major

## Предусловия

Документ находится на этапе обработки информации о погрузке.

## Шаги воспроизведения 
Открыть форму обработки информации о погрузке. 
Установить чекбокс "Замечания при погрузке". 
Не заполнять поля описания замечаний. 
Сохранить документ. 
Запустить формирование второго титула. 

## Фактический результат

Второй титул успешно формируется.

## Ожидаемый результат

Система должна требовать заполнение данных о замечаниях и блокировать формирование титула.

# Bug-003

## После подтверждения получения перевозчиком статус ЭТрН не изменяется

Severity

Major

## Предусловия

Перевозчик получил документ.

## Шаги воспроизведения 
Открыть полученную ЭТрН. 
Нажать "Подтвердить получение". 
Обновить карточку документа. 

## Фактический результат

Статус документа остается прежним.

## Ожидаемый результат

Статус должен измениться на статус, соответствующий этапу подтверждения получения перевозчиком.

## Комментарий

Пользователи не могут определить текущее состояние документа.
